In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('Employees.csv')
df

    Name  Gender      Age  Salary(USD)
0    Mark      M  20.3650         1000
1   John       M  60.3226         1200
2  Edward      M  42.2650         3000
3   Salah      M  31.3800         5000
4   Ahmed      M  42.6800         1700
5    Sara      F  25.3640         1900
6   Julia      F  21.2857         1950
7   John       M  60.3226         1200
8    Mark      M  20.3650         1000

In [3]:
df.drop_duplicates(inplace=True)

In [4]:
df

    Name  Gender      Age  Salary(USD)
0    Mark      M  20.3650         1000
1   John       M  60.3226         1200
2  Edward      M  42.2650         3000
3   Salah      M  31.3800         5000
4   Ahmed      M  42.6800         1700
5    Sara      F  25.3640         1900
6   Julia      F  21.2857         1950

In [5]:
df['Age'].dtype

dtype('float64')

In [6]:
df['Age']=df['Age'].astype(int)

In [7]:
df

    Name  Gender  Age  Salary(USD)
0    Mark      M   20         1000
1   John       M   60         1200
2  Edward      M   42         3000
3   Salah      M   31         5000
4   Ahmed      M   42         1700
5    Sara      F   25         1900
6   Julia      F   21         1950

Assuming 1 dollar=31 EGP

In [8]:
df['Salary(EGP)']=df['Salary(USD)']*31

In [9]:
df

    Name  Gender  Age  Salary(USD)  Salary(EGP)
0    Mark      M   20         1000        31000
1   John       M   60         1200        37200
2  Edward      M   42         3000        93000
3   Salah      M   31         5000       155000
4   Ahmed      M   42         1700        52700
5    Sara      F   25         1900        58900
6   Julia      F   21         1950        60450

In [10]:
#df.drop(['Salary(USD)'],axis=1,inplace=True)
df

    Name  Gender  Age  Salary(USD)  Salary(EGP)
0    Mark      M   20         1000        31000
1   John       M   60         1200        37200
2  Edward      M   42         3000        93000
3   Salah      M   31         5000       155000
4   Ahmed      M   42         1700        52700
5    Sara      F   25         1900        58900
6   Julia      F   21         1950        60450

In [11]:
Average=df['Age'].mean()
print('Average Age : ',Average)

Average Age :  34.42857142857143

In [12]:
Median_EGP=df['Salary(EGP)'].median()
Median_USD=df['Salary(USD)'].median() # remove this
print('Median Salary in EGP: ',Median_EGP)
print('Median Salary in USD: ',Median_USD)# remove this

Median Salary in EGP:  58900.0
Median Salary in EGP:  1900.0

In [13]:
df['Gender'].value_counts()

M    5
F    2
Name: Gender, dtype: int64

In [14]:
male_num=df['Gender'].value_counts()['M']
female_num=df['Gender'].value_counts()['F']
ratio=female_num/male_num 

print('Ration between male and female employee is:',ratio,'which mean that for every',male_num,' male employee there are  ',female_num,'female employee')

Ration between male and female employee is: 0.4 which mean that for every 5  male employee there are   2 female employee

In [15]:
df.to_csv('new employee.csv')